Pembuatan Onject

In [1]:
# Mengimpor lib sebagai berikut:
import numpy as np
import pandas as pd

In [2]:
# Membuat Series dengan meneruskan daftar nilai, memungkinkan panda membuat indeks bilangan bulat default:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# Membuat DataFrame dengan  meneruskan array NumPy, dengan indeks datetime dan kolom berlabel:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.222833  0.309897  0.182732 -1.192047
2013-01-02 -1.436983  1.654496  0.124103  0.455230
2013-01-03 -0.755440 -0.344534 -1.689698 -0.084851
2013-01-04 -0.952336 -1.745434 -0.407317  0.564681
2013-01-05 -0.246854 -0.019881 -1.254590 -0.492861
2013-01-06 -0.369898  0.860512  1.213754  0.521780

In [5]:
# Membuat DataFrame dengan meneruskan kamus objek yang dapat dikonversi menjadi struktur seperti series:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)


df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
# Kolom DataFrame yang dihasilkan  memiliki tipe yang berbeda:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Menampilkan Data

In [7]:
# Berikut adalah cara melihat baris atas:
df.head()

                   A         B         C         D
2013-01-01  0.222833  0.309897  0.182732 -1.192047
2013-01-02 -1.436983  1.654496  0.124103  0.455230
2013-01-03 -0.755440 -0.344534 -1.689698 -0.084851
2013-01-04 -0.952336 -1.745434 -0.407317  0.564681
2013-01-05 -0.246854 -0.019881 -1.254590 -0.492861

In [8]:
# Untuk melihat frame baris bawah
df.tail(3)

                   A         B         C         D
2013-01-04 -0.952336 -1.745434 -0.407317  0.564681
2013-01-05 -0.246854 -0.019881 -1.254590 -0.492861
2013-01-06 -0.369898  0.860512  1.213754  0.521780

In [9]:
# Menampilkan indeks 
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
# Menampilkan kolom
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.to_numpy()

array([[ 0.22283293,  0.30989712,  0.18273247, -1.19204676],
       [-1.43698272,  1.65449616,  0.12410265,  0.45523042],
       [-0.7554397 , -0.34453381, -1.68969819, -0.08485128],
       [-0.95233562, -1.74543439, -0.40731721,  0.56468127],
       [-0.24685401, -0.01988133, -1.25458979, -0.49286062],
       [-0.36989831,  0.86051204,  1.21375435,  0.52178029]])

In [12]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [13]:
# menampilkan ringkasan statistik data:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.589780  0.119176 -0.305169 -0.038011
std    0.583597  1.153629  1.054344  0.701537
min   -1.436983 -1.745434 -1.689698 -1.192047
25%   -0.903112 -0.263371 -1.042772 -0.390858
50%   -0.562669  0.145008 -0.141607  0.185190
75%   -0.277615  0.722858  0.168075  0.505143
max    0.222833  1.654496  1.213754  0.564681

In [14]:
# Mentransposisikan data Anda:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.222833   -1.436983   -0.755440   -0.952336   -0.246854   -0.369898
B    0.309897    1.654496   -0.344534   -1.745434   -0.019881    0.860512
C    0.182732    0.124103   -1.689698   -0.407317   -1.254590    1.213754
D   -1.192047    0.455230   -0.084851    0.564681   -0.492861    0.521780

In [15]:
# Mengurutkan menurut sumbu:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.192047  0.182732  0.309897  0.222833
2013-01-02  0.455230  0.124103  1.654496 -1.436983
2013-01-03 -0.084851 -1.689698 -0.344534 -0.755440
2013-01-04  0.564681 -0.407317 -1.745434 -0.952336
2013-01-05 -0.492861 -1.254590 -0.019881 -0.246854
2013-01-06  0.521780  1.213754  0.860512 -0.369898

In [16]:
# Mengurutkan menurut nilai:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04 -0.952336 -1.745434 -0.407317  0.564681
2013-01-03 -0.755440 -0.344534 -1.689698 -0.084851
2013-01-05 -0.246854 -0.019881 -1.254590 -0.492861
2013-01-01  0.222833  0.309897  0.182732 -1.192047
2013-01-06 -0.369898  0.860512  1.213754  0.521780
2013-01-02 -1.436983  1.654496  0.124103  0.455230

In [17]:
# Memilih satu kolom dari data Series:
df["A"]

2013-01-01    0.222833
2013-01-02   -1.436983
2013-01-03   -0.755440
2013-01-04   -0.952336
2013-01-05   -0.246854
2013-01-06   -0.369898
Freq: D, Name: A, dtype: float64

In [18]:
# Memilih data melalui [], yang mengiris baris:
df[0:3]

                   A         B         C         D
2013-01-01  0.222833  0.309897  0.182732 -1.192047
2013-01-02 -1.436983  1.654496  0.124103  0.455230
2013-01-03 -0.755440 -0.344534 -1.689698 -0.084851

In [19]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -1.436983  1.654496  0.124103  0.455230
2013-01-03 -0.755440 -0.344534 -1.689698 -0.084851
2013-01-04 -0.952336 -1.745434 -0.407317  0.564681

Seleksi berdasarkan label

In [20]:
# Untuk mendapatkan cross section menggunakan label:
df.loc[dates[0]]

A    0.222833
B    0.309897
C    0.182732
D   -1.192047
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
# Memilih pada multi-axis menurut label:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.222833  0.309897
2013-01-02 -1.436983  1.654496
2013-01-03 -0.755440 -0.344534
2013-01-04 -0.952336 -1.745434
2013-01-05 -0.246854 -0.019881
2013-01-06 -0.369898  0.860512

In [23]:
# Menampilkan pengirisan label, kedua titik akhir:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -1.436983  1.654496
2013-01-03 -0.755440 -0.344534
2013-01-04 -0.952336 -1.745434

In [24]:
# Pengurangan dimensi objek yang dikembalikan:
df.loc["20130102", ["A", "B"]]

A   -1.436983
B    1.654496
Name: 2013-01-02 00:00:00, dtype: float64

In [25]:
# Untuk mendapatkan nilai skalar:
df.loc[dates[0], "A"]

0.22283293372692187

In [26]:
# Untuk mendapatkan akses cepat ke skalar (setara dengan metode sebelumnya):
df.at[dates[0], "A"]

0.22283293372692187